In [1]:
# import libraries
import html5lib
import pandas as pd
import investpy
import datetime as dt
import csv

# Urea Price DataFrame

In [2]:
# import Urea dataframe
Urea = pd.read_html("https://www.indexmundi.com/commodities/?commodity=urea&months=360")[1]

In [3]:
Urea.dtypes

Month      object
Price     float64
Change     object
dtype: object

In [5]:
# rename columns 
Urea.rename(columns = {'Month':'Date','Price':'Urea'},inplace=True)

In [6]:
# drop columns
Urea.drop(columns='Change',inplace=True)

In [7]:
Urea.head()

       Date    Urea
0  Jul 1992  120.00
1  Aug 1992  120.00
2  Sep 1992  120.00
3  Oct 1992  116.88
4  Nov 1992  107.50

In [8]:
# Create two columns to datafram month and year
Urea_month = []
Urea_year = []
for i, r in Urea.iterrows():
    Urea_month.append(r["Date"].split()[0])
    Urea_year.append(r["Date"].split()[1])

In [9]:
# add a new column "month_name"
Urea["month_name"] = Urea_month

In [11]:
Urea.head()

       Date    Urea month_name
0  Jul 1992  120.00        Jul
1  Aug 1992  120.00        Aug
2  Sep 1992  120.00        Sep
3  Oct 1992  116.88        Oct
4  Nov 1992  107.50        Nov

In [12]:
# add a new column "year"
Urea["year"] = Urea_year

In [13]:
Urea.head()

       Date    Urea month_name  year
0  Jul 1992  120.00        Jul  1992
1  Aug 1992  120.00        Aug  1992
2  Sep 1992  120.00        Sep  1992
3  Oct 1992  116.88        Oct  1992
4  Nov 1992  107.50        Nov  1992

In [14]:
# convert date to datetime
pd.to_datetime(Urea["Date"])

0     1992-07-01
1     1992-08-01
2     1992-09-01
3     1992-10-01
4     1992-11-01
         ...
355   2022-02-01
356   2022-03-01
357   2022-04-01
358   2022-05-01
359   2022-06-01
Name: Date, Length: 360, dtype: datetime64[ns]

In [15]:
dates = pd.to_datetime(Urea["Date"])

In [16]:
dates.dt.month_name()

0           July
1         August
2      September
3        October
4       November
         ...
355     February
356        March
357        April
358          May
359         June
Name: Date, Length: 360, dtype: object

In [17]:
# add a new columns "month_name2"
Urea["month_name2"] = dates.dt.month_name()

In [18]:
Urea.head()

       Date    Urea month_name  year month_name2
0  Jul 1992  120.00        Jul  1992        July
1  Aug 1992  120.00        Aug  1992      August
2  Sep 1992  120.00        Sep  1992   September
3  Oct 1992  116.88        Oct  1992     October
4  Nov 1992  107.50        Nov  1992    November

In [20]:
# set index to "Date"
Urea.set_index('Date',inplace=True)

In [21]:
# new dataframe
Urea

            Urea month_name  year month_name2
Date
Jul 1992  120.00        Jul  1992        July
Aug 1992  120.00        Aug  1992      August
Sep 1992  120.00        Sep  1992   September
Oct 1992  116.88        Oct  1992     October
Nov 1992  107.50        Nov  1992    November
...          ...        ...   ...         ...
Feb 2022  744.17        Feb  2022    February
Mar 2022  872.50        Mar  2022       March
Apr 2022  925.00        Apr  2022       April
May 2022  707.50        May  2022         May
Jun 2022  690.00        Jun  2022        June

[360 rows x 4 columns]

In [22]:
Urea.dtypes

Urea           float64
month_name      object
year            object
month_name2     object
dtype: object

In [23]:
# 10 years interval of data
Urea['Feb 2012':'Jun 2022']

            Urea month_name  year month_name2
Date
Feb 2012  375.00        Feb  2012    February
Mar 2012  393.13        Mar  2012       March
Apr 2012  494.38        Apr  2012       April
May 2012  513.13        May  2012         May
Jun 2012  456.88        Jun  2012        June
...          ...        ...   ...         ...
Feb 2022  744.17        Feb  2022    February
Mar 2022  872.50        Mar  2022       March
Apr 2022  925.00        Apr  2022       April
May 2022  707.50        May  2022         May
Jun 2022  690.00        Jun  2022        June

[125 rows x 4 columns]

In [ ]:
Urea.to_csv("Urea_Update.csv")

# Wheat Price DataFrame

In [24]:
# import dataframe
US_wheat_df = investpy.get_commodity_historical_data(commodity='US Wheat', from_date='01/01/2012', to_date='01/01/2022')

In [25]:
# check data types
US_wheat_df.dtypes

Open        float64
High        float64
Low         float64
Close       float64
Volume        int64
Currency     object
dtype: object

In [27]:
#reset index 
US_wheat_df.reset_index(inplace=True)

In [38]:
# drop columns
US_wheat_df.drop(['Open','High','Low','Volume'],axis=1,inplace=True)

In [36]:
# rename columns
US_wheat_df.rename(columns = {'Close':'Wheat'},inplace=True)

In [41]:
US_wheat_df = US_wheat_df.drop('Currency',axis=1)

In [42]:
US_wheat_df

           Date   Wheat
0    2012-01-02  653.13
1    2012-01-03  658.38
2    2012-01-04  650.13
3    2012-01-05  627.38
4    2012-01-06  624.63
...         ...     ...
2607 2021-12-27  804.00
2608 2021-12-28  783.50
2609 2021-12-29  787.75
2610 2021-12-30  779.75
2611 2021-12-31  770.75

[2612 rows x 2 columns]

In [44]:
pd.DatetimeIndex(US_wheat_df["Date"]).month

Int64Index([ 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
            ...
            12, 12, 12, 12, 12, 12, 12, 12, 12, 12],
           dtype='int64', name='Date', length=2612)

In [45]:
US_wheat_df["month"] = pd.DatetimeIndex(US_wheat_df["Date"]).month

In [47]:
# addd a month columns to dataframe
US_wheat_df

           Date   Wheat  month
0    2012-01-02  653.13      1
1    2012-01-03  658.38      1
2    2012-01-04  650.13      1
3    2012-01-05  627.38      1
4    2012-01-06  624.63      1
...         ...     ...    ...
2607 2021-12-27  804.00     12
2608 2021-12-28  783.50     12
2609 2021-12-29  787.75     12
2610 2021-12-30  779.75     12
2611 2021-12-31  770.75     12

[2612 rows x 3 columns]

In [49]:
pd.DatetimeIndex(US_wheat_df["Date"]).year

Int64Index([2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012, 2012,
            ...
            2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021],
           dtype='int64', name='Date', length=2612)

In [52]:
# add a year columns to dataframe
US_wheat_df["year"] = pd.DatetimeIndex(US_wheat_df["Date"]).year

In [53]:
US_wheat_df

           Date   Wheat  month  year
0    2012-01-02  653.13      1  2012
1    2012-01-03  658.38      1  2012
2    2012-01-04  650.13      1  2012
3    2012-01-05  627.38      1  2012
4    2012-01-06  624.63      1  2012
...         ...     ...    ...   ...
2607 2021-12-27  804.00     12  2021
2608 2021-12-28  783.50     12  2021
2609 2021-12-29  787.75     12  2021
2610 2021-12-30  779.75     12  2021
2611 2021-12-31  770.75     12  2021

[2612 rows x 4 columns]

In [54]:
pd.DatetimeIndex(US_wheat_df["Date"]).month_name()

Index(['January', 'January', 'January', 'January', 'January', 'January',
       'January', 'January', 'January', 'January',
       ...
       'December', 'December', 'December', 'December', 'December', 'December',
       'December', 'December', 'December', 'December'],
      dtype='object', name='Date', length=2612)

In [55]:
US_wheat_df["month_name"] = pd.DatetimeIndex(US_wheat_df["Date"]).month_name()

In [56]:
US_wheat_df

           Date   Wheat  month  year month_name
0    2012-01-02  653.13      1  2012    January
1    2012-01-03  658.38      1  2012    January
2    2012-01-04  650.13      1  2012    January
3    2012-01-05  627.38      1  2012    January
4    2012-01-06  624.63      1  2012    January
...         ...     ...    ...   ...        ...
2607 2021-12-27  804.00     12  2021   December
2608 2021-12-28  783.50     12  2021   December
2609 2021-12-29  787.75     12  2021   December
2610 2021-12-30  779.75     12  2021   December
2611 2021-12-31  770.75     12  2021   December

[2612 rows x 5 columns]

In [60]:
US_wheat_df.set_index('Date').resample('M')

In [61]:
US_wheat_df.to_csv("US_wheat_df-Update.csv")